### Exercise 1: Import SQLite and connect to a database and close it properly

In [141]:
import sqlite3

In [142]:
conn = sqlite3.connect("lesson.db")

In [143]:
conn.close()

In [144]:
# Better approach
with sqlite3.connect("lesson.db") as conn:
    pass

### Exercise 2: Create a user table and insert a row in it

In [145]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("CREATE TABLE IF NOT EXISTS user (email text, first_name text, last_name text, address text, age integer, PRIMARY KEY (email))")
    cursor.execute("INSERT INTO user VALUES ('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31)")
    conn.commit()

### Exercise 3: Check the first row and get the value.

In [146]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    rows = cursor.execute('SELECT * FROM user')
    for row in rows:
        print(row)

('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31)

### Exercise 4: Insert one more record and then select them with a order by clause

In [147]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("INSERT INTO user VALUES ('tom@web.com', 'Tom', 'Fake', '456 Fantasy lane, Fantasu City', 39)")
    conn.commit()

In [148]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    rows = cursor.execute('SELECT * FROM user ORDER BY age DESC')
    for row in rows:
        print(row)

('tom@web.com', 'Tom', 'Fake', '456 Fantasy lane, Fantasu City', 39)
('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31)

In [149]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    rows = cursor.execute('SELECT * FROM user ORDER BY age')
    for row in rows:
        print(row)

('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31)
('tom@web.com', 'Tom', 'Fake', '456 Fantasy lane, Fantasu City', 39)

### Exercise 5: Alter the table and add another column

In [150]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("ALTER TABLE user ADD COLUMN gender text")

In [151]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    rows = cursor.execute('SELECT * FROM user ORDER BY age')
    for row in rows:
        print(row)

('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('tom@web.com', 'Tom', 'Fake', '456 Fantasy lane, Fantasu City', 39, None)

### Exercise 6: Create another tabble and relate it with User table

In [152]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    sql = """
        CREATE TABLE comments (
            user_id text,
            comments text,
            FOREIGN KEY (user_id) REFERENCES user (email) 
            ON DELETE CASCADE ON UPDATE NO ACTION
        )
    """
    cursor.execute(sql)

### Exercise 7: Populating the comments table

In [153]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    sql = "INSERT INTO comments VALUES ('{}', '{}')"
    rows = cursor.execute('SELECT * FROM user ORDER BY age')
    for row in rows:
        email = row[0]
        print("Going to create rows for {}".format(email))
        name = row[1] + " " + row[2]
        for i in range(10):
            comment = "This is comment {} by {}".format(i, name)
            conn.cursor().execute(sql.format(email, comment))
    conn.commit()

Going to create rows for bob@example.com
Going to create rows for tom@web.com

### Exercise 8: Read comments by Bob

In [154]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    sql = """
        SELECT * FROM comments 
        JOIN user ON comments.user_id = user.email
        WHERE user.email='bob@example.com'
    """
    rows = cursor.execute(sql)
    for row in rows:
        print(row)

('bob@example.com', 'This is comment 0 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 1 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 2 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 3 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 4 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 5 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 6 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 7 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 8 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)
('bob@example.com', 'This is comment 9 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, None)

### Exercise 9: Read selected columns only

In [155]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    sql = """
        SELECT comments.* FROM comments
        JOIN user ON comments.user_id = user.email
        WHERE user.email='bob@example.com'
    """
    rows = cursor.execute(sql)
    for row in rows:
        print(row)

('bob@example.com', 'This is comment 0 by Bob Codd')
('bob@example.com', 'This is comment 1 by Bob Codd')
('bob@example.com', 'This is comment 2 by Bob Codd')
('bob@example.com', 'This is comment 3 by Bob Codd')
('bob@example.com', 'This is comment 4 by Bob Codd')
('bob@example.com', 'This is comment 5 by Bob Codd')
('bob@example.com', 'This is comment 6 by Bob Codd')
('bob@example.com', 'This is comment 7 by Bob Codd')
('bob@example.com', 'This is comment 8 by Bob Codd')
('bob@example.com', 'This is comment 9 by Bob Codd')

### Exercise 10: Delete a row in user table and watch the consequences

In [156]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    cursor.execute("DELETE FROM user WHERE email='bob@example.com'")
    conn.commit()

In [157]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    rows = cursor.execute("SELECT * FROM user")
    for row in rows:
        print(row)

('tom@web.com', 'Tom', 'Fake', '456 Fantasy lane, Fantasu City', 39, None)

In [158]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    rows = cursor.execute("SELECT * FROM comments")
    for row in rows:
        print(row)

('tom@web.com', 'This is comment 0 by Tom Fake')
('tom@web.com', 'This is comment 1 by Tom Fake')
('tom@web.com', 'This is comment 2 by Tom Fake')
('tom@web.com', 'This is comment 3 by Tom Fake')
('tom@web.com', 'This is comment 4 by Tom Fake')
('tom@web.com', 'This is comment 5 by Tom Fake')
('tom@web.com', 'This is comment 6 by Tom Fake')
('tom@web.com', 'This is comment 7 by Tom Fake')
('tom@web.com', 'This is comment 8 by Tom Fake')
('tom@web.com', 'This is comment 9 by Tom Fake')

### Exercise 11: Update a row in User table

In [159]:
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    cursor.execute("UPDATE user set gender='M' where email='tom@web.com'")
    conn.commit()
    rows = cursor.execute("SELECT gender FROM user WHERE email='tom@web.com'")
    for row in rows:
        print(row)

('M',)

### Exercise 12: Creating a Data Frame from the result

In [163]:
import pandas as pd

columns = ["Email", "First Name", "Last Name", "Age", "Gender", "Comments"]
data = []
with sqlite3.connect("lesson.db") as conn:
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = 1")
    
    sql = """
        SELECT user.email, user.first_name, user.last_name, user.age, user.gender, comments.comments FROM comments
        JOIN user ON comments.user_id = user.email
        WHERE user.email = 'tom@web.com'
    """
    rows = cursor.execute(sql)
    for row in rows:
        data.append(row)

In [164]:
df = pd.DataFrame(data, columns=columns)

In [165]:
df.head()

         Email First Name Last Name  Age Gender                       Comments
0  tom@web.com        Tom      Fake   39      M  This is comment 0 by Tom Fake
1  tom@web.com        Tom      Fake   39      M  This is comment 1 by Tom Fake
2  tom@web.com        Tom      Fake   39      M  This is comment 2 by Tom Fake
3  tom@web.com        Tom      Fake   39      M  This is comment 3 by Tom Fake
4  tom@web.com        Tom      Fake   39      M  This is comment 4 by Tom Fake